{
  "irVersion": "1.0",
  "project": "omnillm",
  "repository": "https://github.com/plexusone/omnillm",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.14.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "Three new Chinese LLM providers: GLM (Zhipu AI), Kimi (Moonshot AI), and Qwen (Alibaba Cloud)" },
        { "description": "Provider conformance test package for standardized testing across all providers" }
      ],
      "added": [
        { "description": "**GLM Provider**: Zhipu AI BigModel support with GLM-5, GLM-4.7, GLM-4.5 series and streaming", "commit": "b7f0188" },
        { "description": "**Kimi Provider**: Moonshot AI support with Kimi K2.5, K2 series and Moonshot V1 models", "commit": "b7f0188" },
        { "description": "**Qwen Provider**: Alibaba Cloud Tongyi Qianwen support with Qwen3, QwQ, and Qwen2.5 series", "commit": "b7f0188" },
        { "description": "`ProviderNameGLM`, `ProviderNameKimi`, `ProviderNameQwen` provider constants", "commit": "b7f0188" },
        { "description": "`EnvVarGLMAPIKey`, `EnvVarKimiAPIKey`, `EnvVarQwenAPIKey` environment variable constants", "commit": "b7f0188" },
        { "description": "Model constants in `models/` package for GLM, Kimi, and Qwen models", "commit": "b7f0188" },
        { "description": "`provider/providertest` package for standardized provider conformance testing", "commit": "fc4b2be" },
        { "description": "Conformance tests for all 6 built-in providers (OpenAI, Anthropic, X.AI, GLM, Kimi, Qwen)", "commit": "fc4b2be" }
      ],
      "fixed": [
        { "description": "Scanner buffer size limits in GLM and Kimi streaming (64KB initial, 1MB max) to handle large SSE payloads", "commit": "07b9f00" },
        { "description": "Empty choices error handling in GLM, Kimi, Qwen adapters to return explicit errors instead of nil", "commit": "07b9f00" },
        { "description": "`unparam` lint issues in provider test files by using `testModel` constants", "commit": "8a13e4e" },
        { "description": "gofmt formatting in constants.go", "commit": "8a79375" }
      ],
      "changed": [
        { "description": "CI workflow files renamed for specificity", "commit": "dcdeb52" },
        { "description": "CI workflows updated to use shared workflow templates", "commit": "fb92cb2" },
        { "description": "LICENSE copyright year updated", "commit": "8080991" }
      ],
      "dependencies": [
        { "description": "`github.com/grokify/mogo` upgraded from 0.73.2 to 0.73.5", "commit": "b2279c1" },
        { "description": "`google.golang.org/genai` upgraded from 1.48.0 to 1.50.0", "commit": "1a0f545" }
      ]
    },
    {
      "version": "v0.13.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Go module path changed from `github.com/agentplexus/omnillm` to `github.com/plexusone/omnillm`", "commit": "5837ee2" }
      ]
    },
    {
      "version": "v0.12.0",
      "date": "2026-02-22",
      "highlights": [
        { "description": "Tool/function calling support for OpenAI provider enables agentic workflows" }
      ],
      "added": [
        { "description": "`Tool`, `ToolSpec`, `ToolCall`, `ToolFunction` types for tool calling", "commit": "06824f2" },
        { "description": "`Tools` and `ToolChoice` fields in `ChatCompletionRequest`", "commit": "06824f2" },
        { "description": "`ToolCallID` and `ToolCalls` fields in `Message`", "commit": "06824f2" },
        { "description": "Conversion between unified tool format and OpenAI format", "commit": "06824f2" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site with Material theme", "commit": "3bc816c" },
        { "description": "Organized release notes in docs/releases/", "commit": "3bc816c" }
      ]
    },
    {
      "version": "v0.11.0",
      "date": "2026-01-10",
      "highlights": [
        {
          "description": "**Reliability**: Automatic failover with fallback providers and circuit breaker pattern ensure your app stays up even when providers fail"
        },
        {
          "description": "**Cost Optimization**: Response caching reduces API costs by returning cached responses for identical requests"
        },
        {
          "description": "**Error Prevention**: Pre-flight token estimation validates requests before sending, avoiding context window limit errors"
        }
      ],
      "added": [
        {
          "description": "**Fallback Providers**: Automatic failover to backup providers when primary fails (retryable errors only)",
          "commit": "6a9f4c9"
        },
        {
          "description": "**Circuit Breaker**: Prevents cascading failures by temporarily skipping unhealthy providers",
          "commit": "f5bd1e9"
        },
        {
          "description": "**Token Estimation**: Pre-flight token counting to validate requests before sending to API",
          "commit": "60573ba"
        },
        {
          "description": "**Response Caching**: Cache identical requests using KVS backend with configurable TTL",
          "commit": "1dc3c79"
        },
        {
          "description": "`FallbackProviders` and `CircuitBreakerConfig` fields in `ClientConfig`",
          "commit": "582c556"
        },
        {
          "description": "`TokenEstimator` interface with built-in context windows for 40+ models",
          "commit": "60573ba"
        },
        {
          "description": "`CacheManager` with SHA-256 based cache key generation",
          "commit": "1dc3c79"
        },
        {
          "description": "`ErrorCategory` type with `ClassifyError()` and `IsRetryableError()` for error classification",
          "commit": "9939ee9"
        },
        {
          "description": "`FallbackError` type with detailed attempt tracking",
          "commit": "6a9f4c9"
        },
        {
          "description": "`TokenLimitError` for pre-flight validation failures",
          "commit": "60573ba"
        },
        {
          "description": "`TopK` sampling parameter in `ChatCompletionRequest` (Anthropic, Gemini, Ollama)",
          "commit": "e7dc833"
        },
        {
          "description": "`Seed` parameter for reproducible outputs (OpenAI, X.AI, Ollama)",
          "commit": "e7dc833"
        },
        {
          "description": "`N` parameter for multiple completions (OpenAI)",
          "commit": "e7dc833"
        },
        {
          "description": "`ResponseFormat` type and field for JSON mode responses (OpenAI, Gemini)",
          "commit": "e7dc833"
        },
        {
          "description": "`Logprobs` and `TopLogprobs` parameters for log probability output (OpenAI)",
          "commit": "e7dc833"
        },
        {
          "description": "`ErrNoProviders` error for when `ClientConfig.Providers` is empty",
          "commit": "0d06bd1"
        }
      ],
      "changed": [
        {
          "description": "`ClientConfig` refactored to use unified `Providers []ProviderConfig` slice (index 0 = primary, 1+ = fallbacks)",
          "breaking": true,
          "commit": "0d06bd1"
        },
        {
          "description": "Removed redundant `Provider`, `APIKey`, `BaseURL`, `Region`, `Timeout`, `HTTPClient`, `CustomProvider`, `Extra`, `FallbackProviders` fields from `ClientConfig`",
          "breaking": true,
          "commit": "0d06bd1"
        },
        {
          "description": "`ProviderConfig` now supports `CustomProvider` field for 3rd party provider injection",
          "commit": "0d06bd1"
        },
        {
          "description": "Provider constructors refactored to accept `ProviderConfig` instead of `ClientConfig`",
          "commit": "0d06bd1"
        },
        {
          "description": "`CreateChatCompletion` now supports optional token validation and response caching",
          "commit": "582c556"
        },
        {
          "description": "All provider adapters updated to pass through newly supported parameters",
          "commit": "e7dc833"
        }
      ],
      "documentation": [
        {
          "description": "README.md updated with Fallback Providers, Circuit Breaker, Token Estimation, and Response Caching documentation",
          "commit": "3e22925"
        },
        {
          "description": "RELEASE_NOTES_v0.11.0.md added with comprehensive release notes",
          "commit": "3e22925"
        }
      ],
      "tests": [
        {
          "description": "Circuit breaker tests added (`circuitbreaker_test.go`)",
          "commit": "f5bd1e9"
        },
        {
          "description": "Fallback provider tests added (`fallback_test.go`)",
          "commit": "6a9f4c9"
        },
        {
          "description": "Token estimation tests added (`tokens_test.go`)",
          "commit": "60573ba"
        },
        {
          "description": "Response caching tests added (`cache_test.go`)",
          "commit": "1dc3c79"
        }
      ]
    },
    {
      "version": "v0.10.0",
      "date": "2026-01-04",
      "added": [
        {
          "description": "Claude 4.5 model family: `claude-opus-4-5-20251101`, `claude-sonnet-4-5-20250929`, `claude-haiku-4-5-20251001`",
          "commit": "d0d5eb7"
        },
        {
          "description": "`ClientConfig.Timeout` field for configurable HTTP client timeout (recommended 300s for reasoning models)",
          "commit": "d0d5eb7"
        },
        {
          "description": "Marp presentation and GitHub Pages HTML documentation",
          "commit": "823effa"
        }
      ],
      "changed": [
        {
          "description": "HTTP client handling refactored with `getHTTPClient()` helper integrating both `HTTPClient` and `Timeout` configurations",
          "commit": "d0d5eb7"
        }
      ]
    },
    {
      "version": "v0.9.0",
      "date": "2025-12-27",
      "changed": [
        {
          "description": "Module renamed from `github.com/grokify/metallm` to `github.com/plexusone/omnillm`",
          "breaking": true,
          "commit": "89059fb"
        },
        {
          "description": "Dependencies updated via `go mod`",
          "commit": "459d7b0"
        }
      ]
    },
    {
      "version": "v0.8.0",
      "date": "2025-12-22",
      "added": [
        {
          "description": "ROADMAP.md with project direction",
          "commit": "424b1f7"
        }
      ],
      "changed": [
        {
          "description": "Module renamed from `github.com/grokify/fluxllm` to `github.com/grokify/metallm` for consistency with `metaserp`",
          "breaking": true,
          "commit": "803e617"
        }
      ]
    },
    {
      "version": "v0.7.1",
      "date": "2025-12-21",
      "changed": [
        {
          "description": "Bedrock provider moved to standalone SDK at `github.com/grokify/fluxllm-bedrock`",
          "breaking": true,
          "commit": "46126de"
        }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2025-12-21",
      "added": [
        {
          "description": "`ObservabilityHook` interface for non-invasive tracing, logging, and metrics integration",
          "commit": "609de92"
        },
        {
          "description": "`LLMCallInfo` with unique `CallID` for correlating hook calls in concurrent scenarios",
          "commit": "609de92"
        },
        {
          "description": "Injectable `*slog.Logger` with null logger default for structured logging",
          "commit": "c72feb3"
        },
        {
          "description": "Context-aware logging via `slogutil.ContextWithLogger` for request-scoped correlation",
          "commit": "c72feb3"
        },
        {
          "description": "`ClientConfig.HTTPClient` for custom HTTP transports (retry, tracing, metrics)",
          "commit": "609de92"
        },
        {
          "description": "Retry with exponential backoff support via `mogo/net/http/retryhttp`",
          "commit": "609de92"
        }
      ],
      "changed": [
        {
          "description": "Module renamed from `github.com/grokify/gollm` to `github.com/grokify/fluxllm`",
          "breaking": true,
          "commit": "f65e355"
        }
      ],
      "fixed": [
        {
          "description": "Memory-aware methods (`CreateChatCompletionWithMemory`, `CreateChatCompletionStreamWithMemory`) now properly invoke observability hooks",
          "commit": "fdf42ac"
        }
      ]
    },
    {
      "version": "v0.6.1",
      "date": "2025-12-15",
      "added": [
        {
          "description": "Model constants for all providers in `models/` package",
          "commit": "fe9d331"
        }
      ],
      "changed": [
        {
          "description": "README.md updated for v0.6.0 Grok models documentation",
          "commit": "dc68f9c"
        }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2025-12-14",
      "added": [
        {
          "description": "X.AI Grok provider with full streaming support and Grok 4.1/4/3/2 model families",
          "commit": "65917c8"
        },
        {
          "description": "Anthropic native streaming via Server-Sent Events (SSE)",
          "commit": "5f430f5"
        },
        {
          "description": "`ProviderMetadata` field in `ChatCompletionResponse` and `ChatCompletionChunk` for preserving provider-specific information",
          "commit": "a509740"
        },
        {
          "description": "Comprehensive test suite with 44 automated tests (unit + integration)",
          "commit": "6514343"
        },
        {
          "description": "Mock KVS infrastructure for testing conversation memory",
          "commit": "6514343"
        },
        {
          "description": "Anthropic streaming example in `examples/anthropic_streaming`",
          "commit": "5f430f5"
        },
        {
          "description": "X.AI usage examples in `examples/xai`",
          "commit": "65917c8"
        }
      ],
      "changed": [
        {
          "description": "Replaced `interface{}` with `any` throughout codebase (Go 1.18+ convention)",
          "commit": "b9ed829"
        }
      ],
      "fixed": [
        {
          "description": "Anthropic streaming now fully functional with proper SSE parsing and event type handling",
          "commit": "5f430f5"
        },
        {
          "description": "Ineffectual assignment in `anthropic/anthropic.go`",
          "commit": "0c438f0"
        },
        {
          "description": "All `golangci-lint` issues resolved",
          "commit": "0c438f0"
        }
      ]
    },
    {
      "version": "v0.5.1",
      "date": "2025-12-14",
      "changed": [
        {
          "description": "CI Go versions updated",
          "commit": "d8763ee"
        },
        {
          "description": "Dependencies updated: `actions/setup-go` 5→6, `github/codeql-action` 3→4, `golangci/golangci-lint-action` 8→9, `actions/checkout` 5→6",
          "commit": "e515829"
        },
        {
          "description": "Go module dependencies updated: `github.com/grokify/sogo` 0.12.1→0.12.7, `github.com/aws/aws-sdk-go-v2/config` 1.31.6→1.31.13",
          "commit": "e515829"
        }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2025-09-07",
      "added": [
        {
          "description": "Google Gemini provider with chat and streaming support",
          "commit": "8aebbaf"
        }
      ],
      "changed": [
        {
          "description": "README.md documentation formatting improvements",
          "commit": "6cf247c"
        }
      ],
      "fixed": [
        {
          "description": "Various linting issues resolved",
          "commit": "f0d0c78"
        }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2025-08-31",
      "added": [
        {
          "description": "Custom external provider support via `Provider` interface injection",
          "commit": "2406f7b"
        },
        {
          "description": "Custom provider example in `examples/custom_provider`",
          "commit": "24c557d"
        }
      ],
      "changed": [
        {
          "description": "Major provider architecture refactor (3 phases): internal providers moved to provider-specific directories",
          "breaking": true,
          "commit": "1452c4f"
        },
        {
          "description": "Provider constants moved to `constants.go`",
          "commit": "5c9f78b"
        },
        {
          "description": "README.md updated with Ollama in architecture section",
          "commit": "8cb1c8d"
        }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2025-08-31",
      "added": [
        {
          "description": "Ollama provider for local LLM inference",
          "commit": "3fb07e7"
        },
        {
          "description": "Memory documentation",
          "commit": "ac26c1a"
        },
        {
          "description": "Ollama example in `examples/providers_demo`",
          "commit": "3da55df"
        }
      ],
      "changed": [
        {
          "description": "`examples/basic` refactored to eliminate code duplication",
          "commit": "28459c8"
        },
        {
          "description": "Dependencies updated: AWS SDK Bedrock Runtime 1.37.1→1.38.0, AWS SDK Config 1.31.2→1.31.5, sogo 0.12.0→0.12.1",
          "commit": "59083a6"
        }
      ],
      "fixed": [
        {
          "description": "Linting issues: EOF newline compliance",
          "commit": "216d166"
        }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-08-26",
      "added": [
        {
          "description": "Conversation memory feature for stateful interactions",
          "commit": "e6cad19"
        },
        {
          "description": "CodeQL SAST security scanning in CI",
          "commit": "cc96214"
        },
        {
          "description": "Model constants in dedicated file",
          "commit": "ba6c471"
        }
      ],
      "changed": [
        {
          "description": "Constants reorganized into `constants.go`",
          "commit": "ba6c471"
        },
        {
          "description": "README.md formatting improvements",
          "commit": "27d754f"
        },
        {
          "description": "golangci-lint configuration updated for false positives",
          "commit": "4047541"
        }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-08-26",
      "changed": [
        {
          "description": "README.md updated with correct `pkg.go.dev` link",
          "commit": "b618d78"
        }
      ]
    },
    {
      "version": "v0.0.1",
      "date": "2025-08-25",
      "added": [
        {
          "description": "Initial release with unified LLM SDK",
          "commit": "3f6f4fd"
        },
        {
          "description": "OpenAI provider with GPT model support",
          "commit": "3f6f4fd"
        },
        {
          "description": "Anthropic Claude provider",
          "commit": "3f6f4fd"
        },
        {
          "description": "AWS Bedrock provider",
          "commit": "3f6f4fd"
        },
        {
          "description": "Chat completions API with synchronous and streaming support",
          "commit": "3f6f4fd"
        },
        {
          "description": "CI/CD workflows: golangci-lint, dependabot, CodeQL",
          "commit": "5c67463"
        },
        {
          "description": "MIT License",
          "commit": "075eafd"
        }
      ]
    }
  ]
}
